/*1 Дан макет https://www.figma.com/file/mZwLT9fKktsWuVyfQRoST1/shop-(Copy)-(Copy)?node-id=73%3A140 в котором представлены товары на странице корзины
2 Необходимо создать файл data.js в котором создать переменную dataProducts в которую присвоить JSON данные по товарам. 
3 Вам нужно самостоятельно создать JSON данные (не забыть про кавычки для ключей и значений
4 Добавить все данные из макета, чтобы в дальнейшем по ним мы смогли создать вёрстку */ 

/**/ /**//**//**//**//**//**/ 

/*const dataProducts = `[{
"title": "MANGO PEOPLE T-SHIRT",
"price": "300",
"currency": "USD",
"color": "Red",
"size": "Xl"


},
{
"title": "ELLERY X M'O CAPSULE";
"price": "52",
"currency": "USD",
"color": "Black",
"size": "Xl",
"quantity": 1
}
]`*/ 

/*1 Создаём вёрстку по данному макету
2 Добавляем все теги и стили для них, чтобы получилось один в один как в макете
3 Пока данные для шаблонизации использовать не нужно*/ 

/**/
